      --- System Configuration Dialog ---

Would you like to enter the initial configuration dialog? [yes/no]: no


Press RETURN to get started!



Router>
Router>
Router>
Router>
Router>
Router>
Router>
Router>
Router>enable
Router#config term
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#inter
Router(config)#interface gig
Router(config)#interface gigabitEthernet 0/0/0
Router(config-if)#no sh
Router(config-if)#no shutdown 

Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up

Router(config-if)#
Router(config-if)#do wr
Building configuration...
[OK]
Router(config-if)#
Router(config-if)# exit
Router(config)#inter
Router(config)#interface gig
Router(config)#interface gigabitEthernet 0/0/0.10
Router(config-subif)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0.10, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0.10, changed state to up

Router(config-subif)#encap
Router(config-subif)#encapsulation dot
Router(config-subif)#encapsulation dot1Q 10
Router(config-subif)#ip add
Router(config-subif)#ip address 192.168.1.1 255.255.255.192
Router(config-subif)#exit
Router(config)#inter gig
Router(config)#inter gigabitEthernet 0/0/0.20
Router(config-subif)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0.20, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0.20, changed state to up

Router(config-subif)#encap
Router(config-subif)#encapsulation dot
Router(config-subif)#encapsulation dot1Q 20
Router(config-subif)#ip add
Router(config-subif)#ip address 192.168.1.65 255.255.255.192
Router(config-subif)#do wr
Building configuration...
[OK]
Router(config-subif)#exit
Router(config)#
Router(config)#
Router(config)#
Router(config)#inter
Router(config)#interface gig
Router(config)#interface gigabitEthernet 0/0/0.30
Router(config-subif)#encap
Router(config-subif)#encapsulation dot
Router(config-subif)#encapsulation dot1Q 30
Router(config-subif)#ip add
Router(config-subif)#ip address 192.168.1.129 255.255.255.192
Router(config-subif)#do wr
Building configuration...
[OK]
Router(config-subif)#exit
Router(config)#do show start
Using 939 bytes
!
version 16.6.4
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname Router
!
!
!
!
!
!
!
!
ip cef
no ipv6 cef
!
!
!
!
!
!
!
!
!
!
!
!
spanning-tree mode pvst
!
!
!
!
!
!
interface GigabitEthernet0/0/0
 no ip address
 duplex auto
 speed auto
!
interface GigabitEthernet0/0/0.10
 encapsulation dot1Q 10
 ip address 192.168.1.1 255.255.255.192
!
interface GigabitEthernet0/0/0.20
 encapsulation dot1Q 20
 ip address 192.168.1.65 255.255.255.192
!
interface GigabitEthernet0/0/0.30
 encapsulation dot1Q 30
 ip address 192.168.1.129 255.255.255.192
!
interface GigabitEthernet0/0/1
 no ip address
 duplex auto
 speed auto
 shutdown
!
interface GigabitEthernet0/0/2
 no ip address
 duplex auto
 speed auto
 shutdown
!
interface Vlan1
 no ip address
 shutdown
!
ip classless
!
ip flow-export version 9
!
!
!
!
!
!
!
line con 0
!
line aux 0
!
line vty 0 4
 login
!
!
!
end


Router(config)#
Router(config)#
Router(config)#
Router(config)#serv
Router(config)#service dh
Router(config)#service dhcp 
Router(config)#ip dhac
Router(config)#ip dhcp po
Router(config)#ip dhcp pool Admin-pool
Router(dhcp-config)#net
Router(dhcp-config)#network 192.168.1.0 255.255.255.192
Router(dhcp-config)#defa
Router(dhcp-config)#default-router 192.168.1.1
Router(dhcp-config)#dns
Router(dhcp-config)#dns-server 192.168.1.1
Router(dhcp-config)#doma
Router(dhcp-config)#domain-name Admin.com
Router(dhcp-config)#exit
Router(config)#
Router(config)#
Router(config)#ip dhcp poo
Router(config)#ip dhcp pool HR-POOL
Router(dhcp-config)#net
Router(dhcp-config)#network 192.168.1.64 255.255.255.192
Router(dhcp-config)#defa
Router(dhcp-config)#default-router 192.168.1.65
Router(dhcp-config)#dns
Router(dhcp-config)#dns-server 192.168.1.65
Router(dhcp-config)#domain
Router(dhcp-config)#domain-name 
Router(dhcp-config)#domain-name HR.com
Router(dhcp-config)#exit
Router(config)#
Router(config)#
Router(config)#
Router(config)#ip dhc
Router(config)#ip dhcp p
Router(config)#ip dhcp pool Customer-pool
Router(dhcp-config)#netw
Router(dhcp-config)#network 192.168.1.128 255.255.255.192
Router(dhcp-config)#defa
Router(dhcp-config)#default-router 192.168.1.129
Router(dhcp-config)#dns
Router(dhcp-config)#dns-server 192.168.1.129
Router(dhcp-config)#doma
Router(dhcp-config)#domain-name customer.com
Router(dhcp-config)#exit
Router(config)#